tap "eth-p/software"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Terraform
brew "hashicorp/tap/terraform"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Menu bar icon organizer
cask "bartender"
# App to build and share containerized applications and microservices
cask "docker"
# Screen color temperature controller
cask "flux"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Native app email client for Gmail
cask "mimestream"
# Cloud storage client
cask "onedrive"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Messaging app with a focus on speed and security
cask "telegram"
mas "Amphetamine", id: 937984704
mas "Balance Lock", id: 1019371109
mas "Bitwarden", id: 1352778147
mas "Flow", id: 1423210932
mas "Polyglot", id: 1471801525
mas "The Unarchiver", id: 425424353
